Missing Values

In [74]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.isnull()       # shows all the missing values in data set ( false= not a missing value true= opposite false)

In [ ]:
df.isnull().sum()  # Shows the total no of null values each column has

Handling missing values

In [20]:
# Deleting the entire row for even a single missing value
df.shape

(891, 15)

In [ ]:
df.dropna().shape             # data i reduced by a huge margin therefore it is noly adviced to use this when dataset is big.

(182, 15)

In [ ]:
## deleting the column with the missing values
df.drop(columns=['age','deck'], inplace=True)     # or df.dropna(axis=1, inplace=True)

In [26]:
df.head()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,0,0,8.0500,S,Third,man,True,Southampton,no,True

Imputation Methods

In [ ]:
#Mean imputation - filling missing values with the mean.
#can be useful when the data is normally distributed.
sns.displot(df['age'])

In [ ]:
sns.histplot(df['age'],kde=True)

In [ ]:
df['Age_mean']= df['age'].fillna(df['age'].mean())
df[['Age_mean','age']]

In [ ]:
# Median imputation - filling the missing values with median
# can be used when the data is right or left skwed or has outliers in dataset

df['Age_median']= df['age'].fillna(df['age'].median())
df[['Age_median','age']]

In [50]:
# Mode imputation - filles the missing values with the mode.
# This is a good choice when the data is categorical and the missing values are not related to the other variables.

df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
mode_value = df[df['embarked'].notna()]['embarked'].mode()[0]        # Filtering out the nan vallues then calculating mode, if multiple selcting the first ie, [0]
df['embarked_mode'] = df['embarked'].fillna(mode_value)

In [ ]:
df[['embarked_mode','Age_mean','Age_median']]

In [60]:
df['embarked_mode'].isnull().sum()

np.int64(0)

In [ ]:
## backward and forward fill method
df['age'].ffill()           # fills the missing value with value above it.

In [ ]:
df['age'].bfill()           # fills the missing value with value below it.

In [ ]:
# Randomly selecting a sample and replacing it with the missing value

random_value = df[df['deck'].notna()]['deck'].sample(1, random_state=42).iloc[0]
df['deck_random'] = df['deck'].fillna(random_value)
df[['deck_random','deck']]

In [104]:
# Interpolation - estimating missing values by using existing values in a dataset.

df = pd.DataFrame({'A': [10, 20, None, 40, None, 60]})

# Apply interpolation
df_interpolated = df.interpolate()

print(df_interpolated)

      A
0  10.0
1  20.0
2  30.0
3  40.0
4  50.0
5  60.0